src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сотрудники/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
    реквизитыОбъекта = ЭтотОбъект.Метаданные().Реквизиты;
    Если проверитьРеквизитИзСоставаФИО(реквизитыОбъекта.Фамилия.Имя, ЭтотОбъект.Фамилия) = Ложь Тогда
        отказ = Истина;
        исключитьПроверенныйРеквизит(реквизитыОбъекта.Фамилия.Имя, проверяемыеРеквизиты);
        Возврат;
    КонецЕсли;

    Если НЕ проверитьРеквизитИзСоставаФИО(реквизитыОбъекта.Имя.Имя, ЭтотОбъект.Имя) Тогда
        отказ = Истина;
        исключитьПроверенныйРеквизит(реквизитыОбъекта.Имя.Имя, проверяемыеРеквизиты);
        Возврат;
    КонецЕсли;

    Если ЗначениеЗаполнено(ЭтотОбъект.Отчество)
        И проверитьРеквизитИзСоставаФИО(реквизитыОбъекта.Отчество.Имя, ЭтотОбъект.Отчество) = Ложь Тогда
        отказ = Истина;
        исключитьПроверенныйРеквизит(реквизитыОбъекта.Фамилия.Имя, проверяемыеРеквизиты);
        Возврат;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Функция проверитьРеквизитИзСоставаФИО(Знач имя, Знач значение)
    Если НЕ Справочники.Сотрудники.ВалидацияПолейФио(значение, имя = "Фамилия") Тогда
        сообщение = Новый СообщениеПользователю();
        сообщение.Текст = СтрШаблон("Неверный формат ввода поля ""%1"".", имя);
        сообщение.Поле = имя;
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();

        Возврат Ложь;
    КонецЕсли;

    Возврат Истина;
КонецФункции

Процедура исключитьПроверенныйРеквизит(Знач имяРеквизита, Знач проверяемыеРеквизиты)
    индексЭлемента = проверяемыеРеквизиты.Найти(имяРеквизита);
    Если индексЭлемента >= 0 Тогда
        проверяемыеРеквизиты.Удалить(индексЭлемента);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
